app/controllers/review_controller.rb

  def show
    @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    puts "its over here dumbasssssssss #{params[:review]}"
    @review = Review.new(params.require(:review).permit(:rating, :comment))

    @review.save
---
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["rating", 33], ["comment", "dfgdfgdf"], ["created_at", 2016-10-03 17:18:46 UTC], ["updated_at", 2016-10-03 17:18:46 UTC]]